# Дан список:
# [1, 2, 3, 4, 5, 6]
# Получите из него следующий срез:
# [3, 4, 5]

s = [1, 2, 3, 4, 5, 6]
print(s[2:5])
