# Дан список с числами:
# [1, 2, 3, 4, 5]
# Найдите сумму элементов этого списка.
total = 0
s = [1, 2, 3, 4, 5]
for i in s:
    total += i
print(total)
