# Дана некоторая строка:
# 'abcde'
# Получите список ее символов:
# ['a', 'b', 'c', 'd', 'e']
s = 'abcde'
print(list(s))
