# Дана строка. Выведите в консоль длину этой строки.
str = input("Введите строку: ")
print(len(str))
