# Дан кортеж с числами:
# (1, 2, 3, 4, 5)
# Найдите сумму элементов этого кортежа.

s = (1, 2, 3, 4, 5)
total = 0
for i in s:
    total += i
print(total)
