# Дано некоторое число:
# 12345
# Переверните его:
# 54321
num = 12345
num_str = str(num)

reversed_num = int(num_str[::-1])

print(reversed_num)
