# Дана строка:
# 'abcdef'
# Получите три последних символа этой строки:
# 'def'

s = 'abcdef'
print(s[-3:])
