# Дана строка:
# 'abcdef'
# Получите первых три символа этой строки:
# 'abc'

s = 'abcdef'
print(s[:3])
