# Дано некоторое число:
# 12345
# Получите список цифр этого числа.
s = 12345
print(list(str(s)))
