# Дан список:
# [1, 2, 3, 4, 5, 6]
# Получите из него два последних элемента:
# [5, 6]
s = [1, 2, 3, 4, 5, 6]
print(s[-2:])
print(s[4:])
