# Дан список:
# [1, 2, 3, 4, 5, 6]
# Получите из него следующий срез:
# [1, 2, 3]

s = [1, 2, 3, 4, 5, 6]
print(s[0:3])
