# Дана строка:
# 'abcde'
# Получите список букв этой строки.
s = 'abcde'
print(list(s))
