# Найдите сумму всех целых чисел от 1 до 100.
total = 0
for i in range(1, 101):
    total += i
print(total)
