# Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.

num = int(input("Введите число: "))
if num > 0:
    print("Число положительное")
else:
    print("Число отрицательное")
