# Дана строка. Выведите в консоль последний символ строки.
str = input("Введите строку: ")
print(str)
print(str[-1])
