# Списки
s1 = [1, 2, 3, 4, 5]
# print(s1[0])
s2 = ['a', 'b', 'c', 'd']
# print(s2[1])
s3 = [[1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e']]
s6 = s3 * 3
# print(s6)
# print(s3[0])
# print(s3[0][0])
# print(s3[1][1])
# Добавление нового элемента в конец списка
s1.append(6)
# print(s1)
s2.append('wq')
# print(s2)
s3.append([7, 8, 9])
# print(s3)
# Добавление элемента в любое место
s1.insert(1, 501)
# print(s1)
# # Удлинение(склейка)
s1.extend(s2)
# print(s1)
s4 = s1 + s2
# print(s4)
# Удаление не по индексу, а по элементу
s1.remove(2)
# print(s1)
s8 = ['яблоко', 'апельсин', 'банан']
# print(s8)
s8.remove('яблоко')
# print(s8)
# замена по индексу
s9 = [1, 2, 3, 4, 5, 'яблоко', 'мандарин']
# print(s9)
s9[0] = 15
s9[6] = 'киви'
# print(s9)
# Срезы применять и к спискам и к кортежам можно
# print(s9[2:5])
# Реверс(переворот), сохранить в новую пеменную нельзя
s10 = ['арбуз', 'банан', 'киви', '54']
# print(s10)
s10.reverse()
s11 = s10.reverse()
# print(s10)
# print(s11)
# Сортировка сохранить в новую пеменную нельзя
s12 = [10, 2, 8, 5, 12]
s12.sort()
# print(s12)
s13 = ['арбуз', 'банан', 'киви', 'помело']
s13.sort()
# print(s13)
s14 = ['мама', 'мылом', 'машу', 'мыла']
s14.sort()
# print(s14)
# Кортежи
k1 = (10, 12, 14, 15)
k2 = (16, 17)
k3 = k1 + k2
# print(k3)
k4 = k1 * 2
# print(k4)
